## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| add    | `module.rds_cluster.aws_rds_cluster_instance.instances[1]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rds_cluster.aws_rds_cluster_instance.instances[1] will be created
  + resource "aws_rds_cluster_instance" "instances" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "wordpress-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "wordpress-subnet-group"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "8.0.mysql_aurora.3.08.2"
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "wordpress-instance-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.medium"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + region                                = "ca-central-1"
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-instance-1"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-instance-1"
          + "Terraform"  = "true"
        }
      + writer                                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/rds_cluster/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
